Revit 2027 API
IFCExtrusionCreationData.AreInnerRegionsOpenings Property
 True if inner regions of the extrusion should become openings, false otherwise.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreInnerRegionsOpenings { get; set; }
Public Property AreInnerRegionsOpenings As Boolean
	Get
	Set
public:
property bool AreInnerRegionsOpenings {
	bool get ();
	void set (bool value);
}
member AreInnerRegionsOpenings : bool with get, set
Property Value
Boolean
See Also
Reference
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace